#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

////int main()
////{
//	//int a = 10;
//	////0000000000000000000000000001010  a的补码
//	////0000000000000000000000000010100  a<<2后的补码
//	//int b = a << 1;//<<1就是a向左移动一位，<<2就是向左移动两位,移动的是存储在内存中的二进制位
//	////a向左移一位，a的值不会改变
// //   printf("%d %d\n", a, b);
//	////输出结果为10 20
//
//	//int a = -1;
//	//1000000000000000000000000000001
//	//1111111111111111111111111111110
//	//1111111111111111111111111111111
//
//	//1111111111111111111111111111110
//	//1000000000000000000000000000001
//	//1000000000000000000000000000010
//	//所以b应该是-2
//    //int b = a << 1;
//	//printf("%d %d", a, b);
//
//
//
//
//
//	//return 0;
////}
//
//int main()
//{
//	//int a = 6;
//	//int b = -7;
//	//int c = a & b;//a和b的二进制位的补码进行运算，对应二级制位有0则为零，都为1才为1；
//	////00000000000000000000000000000110  6的补码
//	////11111111111111111111111111111001  -7的补码
//	////00000000000000000000000000000000  正数，无需计算原码
//	//printf("%d", c);//c = 0;
//
//	//int a = 6;
//	//int b = -7;
//	//int c = a | b;//a和b的二进制位的补码进行运算，对应二级制位有0则为零，都为1才为1；
//	////00000000000000000000000000000110  6的补码
//	////11111111111111111111111111111001  -7的补码
//	////11111111111111111111111111111111  负数，需要计算原码
//	////10000000000000000000000000000001  转换后的原码
//	//printf("%d", c);//c = -1;
//
//
//	//int a = 6;
//	//int b = -7;
//	//int c = a ^ b;//a和b的二进制位的补码进行运算，对应二级制位有0则为零，都为1才为1；
//	////00000000000000000000000000000110  6的补码
//	////11111111111111111111111111111001  -7的补码
//	////11111111111111111111111111111111  负数，需要计算原码
//	////10000000000000000000000000000001  转换后的原码
//	//printf("%d", c);//c = -1;
//
//
//	//int a = 0;
//	////00000000000000000000000000000000  --0的补码
//	////11111111111111111111111111111111  --~a的补码
//	////10000000000000000000000000000001  --~a的原码
//	//printf("%d", ~a);
//
//
//	return 0;
//}


//
//不能创建临时变量（第三个变量），实现两个整数的交换。
//int main()
//{
//	int a = 3;
//	int b = 5;
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//
//	printf("%d %d", a, b);
//	return 0;
//}

//编写代码实现，求一个整数在内存中的二进制位中1的个数
//int count_bit_one(unsigned int n)
//{
//	int count = 0;
//	while (n)
//	{
//		if ((n % 2 )== 1)
//		{
//			count++;
//		}
//		n = n / 2;
//	}
//	return count;
//}

//int count_bit_one(unsigned int n)
//{
//	int i = 0;
//	int count = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (((n >> i) & 1) == 1)
//		{
//			count++;
//		}
//	}
//	return count;
//}


//int count_bit_one(unsigned int n)
//{
//	int i = 0;
//	int count = 0;
//	while (n)
//	{
//		n = n & (n - 1);
//		count++;
//	}
//	return count;
//}
//
//int main()
//
//{
//	int num = 0;
//	scanf("%d", &num);
//	int ret = count_bit_one(num);
//	printf("%d\n", ret);
//	return 0;
//}

//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	if ((n & (n - 1)) == 0)
//	printf("是2的次方数");
//
//
//	return 0;
//}

//int main()
//{
//	//编写代码将13⼆进制序列的第5位修改为1，然后再改回0
//	////13的2进制序列：  00000000000000000000000000001101
//	//// 将第5位置为后： 00000000000000000000000000011101
//	//// 将第5位再置为0：00000000000000000000000000001101
//	//int a = 13;
//	//int n = 5;
//	//a = a | 1 << (n - 1);//或1
//	//printf("%d\n", a);
//	////改回来
//	//a &= ~(1 << (n - 1));
//	//printf("%d", a);
//
//
//
//	return 0;
//}

//int main()
//{
//	//int a = 1;
//	//int b = 2;
//	//int c = (a > b, a = b + 10, a, b = a + 1);
//	//printf("%d", c);//  c 是 13
//
//	//if (a = b + 1, c = a / 2, c > 0)//真正起到判断作用的是最后一个表达式
//
//////假代码
////	a = get_val();
////	count_val(a);
////	while (a > 0)
////	{
////		//业务处理
////		a = get_val();
////		count_val(a);
////	}
////
//////如果使⽤逗号表达式，改写：
////	while (a = get_val(), count_val(a), a > 0)
////	{
////		//业务处理
////
////	}
//
//
//	return 0;
//}

//int main()
//{
//	/*int arr[10] = { 1,2,3,4,5 };
//	arr[4];*///下标为4的元素
//	// 使用[]下标引用操作符来访问arr中下标为4的元素
//	//操作数：arr，4
//
//
//
//
//	printf("hehe\n");// ( )就是函数调用操作符
//	//调用自定义函数也是
//	int ret = Add(3, 5);
//
//
//
//	return 0;
//}



//int Add(int x, int y)
//{
//	return x + y;
//}
//
//int main()
//{
//	printf("hehe\n");// ( )就是函数调用操作符，操作数是函数名printf 传递的字符串hehe
//	//调用自定义函数也是
//	int ret = Add(3, 5);//操作数：是函数名Add，传递的参数3 5
//	return 0;
//}


//struct tag//自定义标签
//{
//	member - list;//成员列表
//}variable - list;//变量列表



struct Student
{
	//成员列表
	char name[20];
	int age;
	float score;
}s4, s5, s6;//全局变量

struct Student s3 = { "王五",18,88.5 };//全局变量

struct S
{
	char ch;
	struct Student;
	double d;
};

int main()
{
	struct Student s1 = { "翠花",20,98.0 };
	struct Student s2; //局部变量也可以初始化
	struct S s = { 'a',{"旺财，19,77.5"},3.14 };

	return 0;
}

