#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//
//int main()
//{
//	//二维数组初始化
//	//int data1[3][5] = { 1, 2, 3, 4, 5, };
//	//int data2[3][5] = { 0 };//不完全初始化
//	//int data3[3][5] = { 1, 2, 3, 4, 5, 6, 7, 8 ,9, 10, 11, 12,13,14,15 };//完全初始化
//	//int data4[3][5] = { {1,2},{3,4},{4,5} };
//
//	//int data5[][5] = { 1, 2, 3, 4, 5, 6, 7, 8 };
//	//int data6[][5] = { {1,2},{3,4},{5,6} };
//
//
//	int arr[3][5] = { 1,2,3,4,5, 2,3,4,5,6, 3,4,5,6,7 };
//	printf("%d\n", arr[1][2]);//通过下标访问数组元素
//
//	//1 2 3 4 5
//	//2 3 4 5 6
//	//3 4 5 6 7
//
//
//
//
//	return 0;
//}

int main()
{
	int i = 0;
	int arr[3][5] = { 0 };
	//输入
	for (i = 0; i < 3; i++)
	{
		
		int j = 0;
		for (j = 0; j < 5; j++)
		{
			scanf("%d", &arr[i][j]);
		}
	}

	//输出
	for (i = 0; i < 3; i++)
	{

		int j = 0;
		for (j = 0; j < 5; j++)
		{
			printf("%d ", arr[i][j]);
		}
	}
	
	return 0;
}